#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
// #![allow(non_snake_case)]
// #![allow(unsafe_op_in_unsafe_fn)]
// #![allow(unnecessary_transmutes)]
// #![allow(clippy::all)]

/* automatically generated by rust-bindgen 0.71.1 */

pub const GID_MAX: u32 = 2147483647;
pub const NGROUPS_MAX: u32 = 16;
pub const UID_MAX: u32 = 2147483647;
pub const PROC_PIDTBSDINFO: u32 = 3;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_uid_t = __uint32_t;
pub type dev_t = __darwin_dev_t;
pub type blkcnt_t = __darwin_blkcnt_t;
pub type blksize_t = __darwin_blksize_t;
pub type gid_t = __darwin_gid_t;
pub type mode_t = __darwin_mode_t;
pub type nlink_t = __uint16_t;
pub type off_t = __darwin_off_t;
pub type uid_t = __darwin_uid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: dev_t,
    pub st_mode: mode_t,
    pub st_nlink: nlink_t,
    pub st_ino: __darwin_ino64_t,
    pub st_uid: uid_t,
    pub st_gid: gid_t,
    pub st_rdev: dev_t,
    pub st_atimespec: timespec,
    pub st_mtimespec: timespec,
    pub st_ctimespec: timespec,
    pub st_birthtimespec: timespec,
    pub st_size: off_t,
    pub st_blocks: blkcnt_t,
    pub st_blksize: blksize_t,
    pub st_flags: __uint32_t,
    pub st_gen: __uint32_t,
    pub st_lspare: __int32_t,
    pub st_qspare: [__int64_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stat"][::std::mem::size_of::<stat>() - 144usize];
    ["Alignment of stat"][::std::mem::align_of::<stat>() - 8usize];
    ["Offset of field: stat::st_dev"][::std::mem::offset_of!(stat, st_dev) - 0usize];
    ["Offset of field: stat::st_mode"][::std::mem::offset_of!(stat, st_mode) - 4usize];
    ["Offset of field: stat::st_nlink"][::std::mem::offset_of!(stat, st_nlink) - 6usize];
    ["Offset of field: stat::st_ino"][::std::mem::offset_of!(stat, st_ino) - 8usize];
    ["Offset of field: stat::st_uid"][::std::mem::offset_of!(stat, st_uid) - 16usize];
    ["Offset of field: stat::st_gid"][::std::mem::offset_of!(stat, st_gid) - 20usize];
    ["Offset of field: stat::st_rdev"][::std::mem::offset_of!(stat, st_rdev) - 24usize];
    ["Offset of field: stat::st_atimespec"][::std::mem::offset_of!(stat, st_atimespec) - 32usize];
    ["Offset of field: stat::st_mtimespec"][::std::mem::offset_of!(stat, st_mtimespec) - 48usize];
    ["Offset of field: stat::st_ctimespec"][::std::mem::offset_of!(stat, st_ctimespec) - 64usize];
    ["Offset of field: stat::st_birthtimespec"]
        [::std::mem::offset_of!(stat, st_birthtimespec) - 80usize];
    ["Offset of field: stat::st_size"][::std::mem::offset_of!(stat, st_size) - 96usize];
    ["Offset of field: stat::st_blocks"][::std::mem::offset_of!(stat, st_blocks) - 104usize];
    ["Offset of field: stat::st_blksize"][::std::mem::offset_of!(stat, st_blksize) - 112usize];
    ["Offset of field: stat::st_flags"][::std::mem::offset_of!(stat, st_flags) - 116usize];
    ["Offset of field: stat::st_gen"][::std::mem::offset_of!(stat, st_gen) - 120usize];
    ["Offset of field: stat::st_lspare"][::std::mem::offset_of!(stat, st_lspare) - 124usize];
    ["Offset of field: stat::st_qspare"][::std::mem::offset_of!(stat, st_qspare) - 128usize];
};
unsafe extern "C" {
    pub fn fstat(arg1: ::std::os::raw::c_int, arg2: *mut stat) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimens(__fd: ::std::os::raw::c_int, __times: *const timespec)
    -> ::std::os::raw::c_int;
}
pub type clockid_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proc_bsdinfo {
    pub pbi_flags: u32,
    pub pbi_status: u32,
    pub pbi_xstatus: u32,
    pub pbi_pid: u32,
    pub pbi_ppid: u32,
    pub pbi_uid: uid_t,
    pub pbi_gid: gid_t,
    pub pbi_ruid: uid_t,
    pub pbi_rgid: gid_t,
    pub pbi_svuid: uid_t,
    pub pbi_svgid: gid_t,
    pub rfu_1: u32,
    pub pbi_comm: [::std::os::raw::c_char; 16usize],
    pub pbi_name: [::std::os::raw::c_char; 32usize],
    pub pbi_nfiles: u32,
    pub pbi_pgid: u32,
    pub pbi_pjobc: u32,
    pub e_tdev: u32,
    pub e_tpgid: u32,
    pub pbi_nice: i32,
    pub pbi_start_tvsec: u64,
    pub pbi_start_tvusec: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of proc_bsdinfo"][::std::mem::size_of::<proc_bsdinfo>() - 136usize];
    ["Alignment of proc_bsdinfo"][::std::mem::align_of::<proc_bsdinfo>() - 8usize];
    ["Offset of field: proc_bsdinfo::pbi_flags"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_flags) - 0usize];
    ["Offset of field: proc_bsdinfo::pbi_status"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_status) - 4usize];
    ["Offset of field: proc_bsdinfo::pbi_xstatus"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_xstatus) - 8usize];
    ["Offset of field: proc_bsdinfo::pbi_pid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_pid) - 12usize];
    ["Offset of field: proc_bsdinfo::pbi_ppid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_ppid) - 16usize];
    ["Offset of field: proc_bsdinfo::pbi_uid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_uid) - 20usize];
    ["Offset of field: proc_bsdinfo::pbi_gid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_gid) - 24usize];
    ["Offset of field: proc_bsdinfo::pbi_ruid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_ruid) - 28usize];
    ["Offset of field: proc_bsdinfo::pbi_rgid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_rgid) - 32usize];
    ["Offset of field: proc_bsdinfo::pbi_svuid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_svuid) - 36usize];
    ["Offset of field: proc_bsdinfo::pbi_svgid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_svgid) - 40usize];
    ["Offset of field: proc_bsdinfo::rfu_1"][::std::mem::offset_of!(proc_bsdinfo, rfu_1) - 44usize];
    ["Offset of field: proc_bsdinfo::pbi_comm"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_comm) - 48usize];
    ["Offset of field: proc_bsdinfo::pbi_name"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_name) - 64usize];
    ["Offset of field: proc_bsdinfo::pbi_nfiles"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_nfiles) - 96usize];
    ["Offset of field: proc_bsdinfo::pbi_pgid"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_pgid) - 100usize];
    ["Offset of field: proc_bsdinfo::pbi_pjobc"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_pjobc) - 104usize];
    ["Offset of field: proc_bsdinfo::e_tdev"]
        [::std::mem::offset_of!(proc_bsdinfo, e_tdev) - 108usize];
    ["Offset of field: proc_bsdinfo::e_tpgid"]
        [::std::mem::offset_of!(proc_bsdinfo, e_tpgid) - 112usize];
    ["Offset of field: proc_bsdinfo::pbi_nice"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_nice) - 116usize];
    ["Offset of field: proc_bsdinfo::pbi_start_tvsec"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_start_tvsec) - 120usize];
    ["Offset of field: proc_bsdinfo::pbi_start_tvusec"]
        [::std::mem::offset_of!(proc_bsdinfo, pbi_start_tvusec) - 128usize];
};
unsafe extern "C" {
    pub fn proc_pidinfo(
        pid: ::std::os::raw::c_int,
        flavor: ::std::os::raw::c_int,
        arg: u64,
        buffer: *mut ::std::os::raw::c_void,
        buffersize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pam_message {
    pub msg_style: ::std::os::raw::c_int,
    pub msg: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pam_message"][::std::mem::size_of::<pam_message>() - 16usize];
    ["Alignment of pam_message"][::std::mem::align_of::<pam_message>() - 8usize];
    ["Offset of field: pam_message::msg_style"]
        [::std::mem::offset_of!(pam_message, msg_style) - 0usize];
    ["Offset of field: pam_message::msg"][::std::mem::offset_of!(pam_message, msg) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pam_response {
    pub resp: *mut ::std::os::raw::c_char,
    pub resp_retcode: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pam_response"][::std::mem::size_of::<pam_response>() - 16usize];
    ["Alignment of pam_response"][::std::mem::align_of::<pam_response>() - 8usize];
    ["Offset of field: pam_response::resp"][::std::mem::offset_of!(pam_response, resp) - 0usize];
    ["Offset of field: pam_response::resp_retcode"]
        [::std::mem::offset_of!(pam_response, resp_retcode) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pam_conv {
    pub conv: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut *const pam_message,
            arg3: *mut *mut pam_response,
            arg4: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub appdata_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pam_conv"][::std::mem::size_of::<pam_conv>() - 16usize];
    ["Alignment of pam_conv"][::std::mem::align_of::<pam_conv>() - 8usize];
    ["Offset of field: pam_conv::conv"][::std::mem::offset_of!(pam_conv, conv) - 0usize];
    ["Offset of field: pam_conv::appdata_ptr"]
        [::std::mem::offset_of!(pam_conv, appdata_ptr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pam_handle {
    _unused: [u8; 0],
}
pub type pam_handle_t = pam_handle;
pub const PAM_SUCCESS: _bindgen_ty_4 = 0;
pub const PAM_CONV_ERR: _bindgen_ty_4 = 6;
pub const PAM_NEW_AUTHTOK_REQD: _bindgen_ty_4 = 10;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const PAM_PROMPT_ECHO_OFF: _bindgen_ty_5 = 1;
pub const PAM_PROMPT_ECHO_ON: _bindgen_ty_5 = 2;
pub const PAM_ERROR_MSG: _bindgen_ty_5 = 3;
pub const PAM_TEXT_INFO: _bindgen_ty_5 = 4;
pub const PAM_MAX_RESP_SIZE: _bindgen_ty_5 = 512;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const PAM_SILENT: _bindgen_ty_6 = -2147483648;
pub const PAM_DELETE_CRED: _bindgen_ty_6 = 2;
pub const PAM_REINITIALIZE_CRED: _bindgen_ty_6 = 4;
pub const PAM_CHANGE_EXPIRED_AUTHTOK: _bindgen_ty_6 = 4;
pub type _bindgen_ty_6 = ::std::os::raw::c_int;
pub const PAM_USER: _bindgen_ty_7 = 2;
pub const PAM_RUSER: _bindgen_ty_7 = 8;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn pam_acct_mgmt(
        _pamh: *mut pam_handle_t,
        _flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_authenticate(
        _pamh: *mut pam_handle_t,
        _flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_chauthtok(
        _pamh: *mut pam_handle_t,
        _flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_close_session(
        _pamh: *mut pam_handle_t,
        _flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_end(
        _pamh: *mut pam_handle_t,
        _status: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_set_item(
        _pamh: *mut pam_handle_t,
        _item_type: ::std::os::raw::c_int,
        _item: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_setcred(
        _pamh: *mut pam_handle_t,
        _flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_start(
        _service: *const ::std::os::raw::c_char,
        _user: *const ::std::os::raw::c_char,
        _pam_conv: *const pam_conv,
        _pamh: *mut *mut pam_handle_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pam_strerror(
        _pamh: *const pam_handle_t,
        _error_number: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
